<?php
/**
 * //                            _ooOoo_
 * //                           o8888888o
 * //                           88" . "88
 * //                           (| -_- |)
 * //                            O\ = /O
 * //                        ____/`---'\____
 * //                      .   ' \\| |// `.
 * //                       / \\||| : |||// \
 * //                     / _||||| -:- |||||- \
 * //                       | | \\\ - /// | |
 * //                     | \_| ''\---/'' | |
 * //                      \ .-\__ `-` ___/-. /
 * //                   ___`. .' /--.--\ `. . __
 * //                ."" '< `.___\_<|>_/___.' >'"".
 * //               | | : `- \`.;`\ _ /`;.`/ - ` : | |
 * //                 \ \ `-. \_ __\ /__ _/ .-` / /
 * //         ======`-.____`-.___\_____/___.-`____.-'======
 * //                            `=---='
 * //
 * //         .............................................
 * //                  佛祖保佑             永无BUG
 * DEC : 获取红包列表
 * User: David Wang
 * Time: 2018/10/25 下午6:20
 */

namespace wallet\classes\card;

class Card {

    public static function cardList() {
        return apply_filter('wallet\cardList', [
            'Rmb_one' => new CashCard('一元现金红包', 'cash', 10, 100, '这是一个一元现金红包'),
            'Rmb_two' => new CashCard('二元现金红包', 'cash', 20, 200, '这是一个二元现金红包')
        ]);
    }

}